-- Override do dashboard padrão do LazyVim.
-- Troca o header "LazyVim" por "Amthy".

return {
  {
    "folke/snacks.nvim",
    opts = {
      dashboard = {
        preset = {
          header = [[
 █████╗  ███╗   ███╗ ████████╗ ██╗  ██╗ ██╗   ██╗
██╔══██╗ ████╗ ████║ ╚══██╔══╝ ██║  ██║ ╚██╗ ██╔╝
███████║ ██╔████╔██║    ██║    ███████║  ╚████╔╝ 
██╔══██║ ██║╚██╔╝██║    ██║    ██╔══██║   ╚██╔╝  
██║  ██║ ██║ ╚═╝ ██║    ██║    ██║  ██║    ██║   
╚═╝  ╚═╝ ╚═╝     ╚═╝    ╚═╝    ╚═╝  ╚═╝    ╚═╝   ]],
        },
      },
    },
  },
}
